Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum,Tekla.Structures.Model.ModelObject)
Instantiates a new enumerator of given type.
Type: Type of enumerator
SubType: Subtype of enumerator
Object: Additional ModelObject instance needed to create the enumerator

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum)
Instantiates a new enumerator of given type.
Type: Type of the enumerator

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Instantiates a new enumerator of given object type.
Type:
ObjectType:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.Type[])
Instantiates a new enumerator of given object type.
Type:
TypeFilter:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.String)
Instantiates a new enumerator of given object type and filter.
Type:
ObjectType:
FilterName:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.Int32,System.Int32)
Instantiates a new enumerator for modified objects after ModStamp.
Type:
ModStamp:
SaveStamp:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.Int32,System.Int32)
Instantiates a new enumerator for modified or deleted objects after Stamp.
Type:
Enum:
ModStamp:
SaveStamp:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(System.Collections.ArrayList,System.Collections.ArrayList)
Enumerator with alredy defined IDs and types
Identifiers: Identifiers to enumerate
Types: Types to enumerate

Tekla.Structures.Model.ModelObjectEnumerator.GetAllFromDB(Tekla.Structures.ModelInternal.dotEnumerator_t@)
Gets the objects from DB. Enumerator's rules must
be correctly filled in before calling this method.
Enumerator: Enumerator including possible select rules and filters.
Returns:

Tekla.Structures.Model.ModelObjectEnumerator.GetAllFromDB_FAST(Tekla.Structures.ModelInternal.dotEnumerator_t@)
Gets the objects from DB. Enumerator's rules must
be correctly filled in before calling this method.
Enumerator: Enumerator including possible select rules and filters.
Returns:

Tekla.Structures.Model.ModelObjectEnumerator.GetAllFromDB(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum)
Get objects from DB by Enumerator
Returns: false on failure